<?php
/**
 * Created by PhpStorm.
 * User: artem
 * Date: 12.10.18
 * Time: 7:01
 */

////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************* NAMESPACES *******************************************/
////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Для того чтобы указать пространство для конкретного класса используется слово namespace,
 * за которым следует само имя. Указывается оно в файле с классом, перед определением класса.
 * На примере класса User это будет выглядеть следующим образом:
 * src/Models/Users/User.php
 *
 * Задается пространство имен обратным слешем (как в windows).
 * Без коренного слеша.
 */

namespace Models\Users;

class User
{
    private $name;

    public function __construct(string $name)
    {
        $this->name = $name;
    }

    public function getName(): string
    {
        return $this->name;
    }
}