<?php
/**
 * Created by PhpStorm.
 * User: artem
 * Date: 12.10.18
 * Time: 7:01
 */

////////////////////////////////////////////////////////////////////////////////////////////////////
/**************************************** CLASS AUTOLOADER ****************************************/
////////////////////////////////////////////////////////////////////////////////////////////////////
require_once 'class_auto_loader.php';

////////////////////////////////////////////////////////////////////////////////////////////////////
/***************************************** USE NAMESPACES *****************************************/
////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * Обращение к имени класса осуществляется
 * начиная с корневого обратного слеша (как в windows).
 */
$author = new \Models\Users\User('Иван');
$article = new \Models\Articles\Article('Заголовок', 'Текст', $author);

echo '<pre>';
var_dump($author);
var_dump($article);
echo '</pre>';